In [1]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [2]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

Ans :- 
The main distinction between the two methods is:

1. loc gets rows (and/or columns) with particular labels.

2. iloc gets rows (and/or columns) at integer locations.

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2]. Did you observe any difference in both the outputs? If so then explain it.

In [3]:
df.index = [3,0,1,2]
new_df = df
new_df

        course_name  duration
3      Data Science         2
0  Machine Learning         3
1          Big Data         6
2     Data Engineer         4

In [4]:
new_df.iloc[2]

course_name    Big Data
duration              6
Name: 1, dtype: object

In [5]:
new_df.loc[2]

course_name    Data Engineer
duration                   4
Name: 2, dtype: object

observation :- 
  1. loc[] :-  It fetch data according to asigned index number of dataframe.
  2. iloc[] :- its fetch data according to auto created  ith index of dataframe by pandas

In [6]:
#Consider the below code to answer further questions:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [7]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.032269  0.738984  0.162155  0.485339  0.738714  0.345170
2  0.058236  0.941609  0.985332  0.145409  0.639319  0.331699
3  0.136451  0.054205  0.384901  0.832917  0.122182  0.870016
4  0.667682  0.706191  0.343017  0.337984  0.030830  0.020153
5  0.072324  0.005546  0.614402  0.447119  0.035797  0.638523
6  0.859168  0.492347  0.948876  0.775438  0.901271  0.510549

Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.

In [8]:
df1.describe().iloc[1]

column_1    0.304355
column_2    0.489813
column_3    0.573114
column_4    0.504034
column_5    0.411352
column_6    0.452685
Name: mean, dtype: float64

(ii) standard deviation of column, ‘column_2’

In [9]:
df1.describe().iloc[2,1]

0.3840054665102536

Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [10]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.032269  0.738984  0.162155  0.485339  0.738714  0.345170
2  0.058236  0.941609  0.985332  0.145409  0.639319  0.331699
3  0.136451  0.054205  0.384901  0.832917  0.122182  0.870016
4  0.667682  0.706191  0.343017  0.337984  0.030830  0.020153
5  0.072324  0.005546  0.614402  0.447119  0.035797  0.638523
6  0.859168  0.492347  0.948876  0.775438  0.901271  0.510549

In [11]:
df1.loc[1:2]

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.032269  0.738984  0.162155  0.485339  0.738714  0.345170
2  0.058236  0.941609  0.985332  0.145409  0.639319  0.331699

In [12]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [13]:
df1.loc[2,'column_2']='S'
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.969337  0.817347  0.397785  0.198079  0.644546  0.198158
2  0.435727         S  0.838195  0.660476  0.461442  0.839537
3  0.918666  0.383415  0.440024  0.741702  0.048665  0.207496
4  0.214884  0.384259  0.444004  0.780267  0.679341  0.934420
5  0.905468  0.676788  0.800469  0.709720  0.774704  0.643647
6  0.297650  0.961793  0.703200  0.792067  0.323959  0.663596

In [14]:
# df1["column_2"].mean()

Explanation of Error comes :-
(TypeError: unsupported operand type(s) for +: 'float' and 'str') there is typeError occurs this means is There is a value within column_ that is a String type which cannot be sum of all values which is float type of column_2 and to find the mean of that column.

Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

Ans :-  windows functions help us to perform aggregated calculations across various partitions or cross-sections of the data.
    windows function in Pandas, returns a value for every row of the original table.
    
    Windows function in Pandas can be broadly divided into three categories namely-


(a) Rolling window: Generic fixed or variable sliding window over the values.

(b) Weighted window: Weighted, non-rectangular window supplied by the scipy.signal library.

(c) Expanding window: Accumulating window over the values.

(d) Exponentially Weighted window: Accumulating and exponentially weighted window over the values.

Q7. Write a code to print only the current month and year at the time of answering this question.
[Hint: Use pandas.datetime function]

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.

In [17]:
import datetime
date_entryone = input('Enter first date in YYYY-MM-DD format')
date_entrytwo = input('Enter second date in YYYY-MM-DD format')

df2 = pd.DataFrame(data = {
    'from_date':[pd.Timestamp(date_entryone)],
    'to_date':[pd.Timestamp(date_entrytwo)]
})
df2['time_delta'] = (df2.from_date - df2.to_date)
#df2['tot_month_diff'] = (df.from_date - df.to_date)
df2

Enter first date in YYYY-MM-DD format2022-05-05
Enter second date in YYYY-MM-DD format2022-04-04

   from_date    to_date time_delta
0 2022-05-05 2022-04-04    31 days

In [ ]:
# time_str = input("enter time in this format yyyy-mm-dd")
# time=datetime.datetime.strptime(time_str, "%Y-%m-%d") 
# time

In [ ]:
x=pd.Timedelta(1985, unit='Y').days
x